pareto-results/sglang_isl1000_osl1000_tp1/concurrency=8/bench.log
/localhome/local-triv/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/datasets/fixed_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=24, sharegpt_output_len=1000, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=8, output_file='/localhome/local-triv/pareto-results/sglang_isl1000_osl1000_tp1/concurrency=8/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=True, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/datasets/fixed_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=24, sharegpt_output_len=1000, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=8, output_file='/localhome/local-triv/pareto-results/sglang_isl1000_osl1000_tp1/concurrency=8/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=True, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 24024
#Output tokens: 24000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 24/24 [01:25<00:00,  3.56s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 8         
Successful requests:                     24        
Benchmark duration (s):                  85.46     
Total input tokens:                      24024     
Total generated tokens:                  24000     
Total generated tokens (retokenized):    24000     
Request throughput (req/s):              0.28      
Input token throughput (tok/s):          281.12    
Output token throughput (tok/s):         280.84    
Total token throughput (tok/s):          561.96    
Concurrency:                             8.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   28474.84  
Median E2E Latency (ms):                 31204.49  
---------------Time to First Token----------------
Mean TTFT (ms):                          1934.34   
Median TTFT (ms):                        1424.62   
P99 TTFT (ms):                           3161.62   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           26.57     
Median ITL (ms):                         25.04     
P95 ITL (ms):                            44.08     
P99 ITL (ms):                            45.01     
Max ITL (ms):                            2713.19   
==================================================